{
  "AzkarList": [
    {
      "arAzkar": "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.",
      "arInfo": "آية الكرسى - البقرة 255",
      "enAzkar": "It is from the sunnah to recite the verse of the Footstool (Ayat-Al-Kursiy) after each prayer:{Allahu la ilaha illa huwa alhayyu alqayyoomu la ta/khuthuhu sinatun wala nawm…}\nAl-Baqarah:255",
      "enInfo": "Al-Baqarah:255",
      "groupId": 1,
      "id": 1,
      "repeat": 1
    },
    {
      "arAzkar": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
      "arInfo": "",
      "enAzkar": "{Qul huwa Allahu ahad…}\tAl-Ikhlasٌ",
      "enInfo": "",
      "groupId": 1,
      "id": 2,
      "repeat": 3
    },
    {
      "arAzkar": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
      "arInfo": "",
      "enAzkar": "{Qul aAAoothu birabbi alfalaq…..}\tAl-Falaq",
      "enInfo": "",
      "groupId": 1,
      "id": 3,
      "repeat": 3
    },
    {
      "arAzkar": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
      "arInfo": "",
      "enAzkar": "{Qul aAAoothu birabbi alnnas…..}\tAn-Nas",
      "enInfo": "",
      "groupId": 1,
      "id": 4,
      "repeat": 3
    },
    {
      "arAzkar": "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
      "arInfo": "",
      "enAzkar": "Asbahna wa-asbahal-mulku lillah walhamdu lillah la ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer, rabbi as-aluka khayra ma fee hathihil-laylah, wakhayra ma baAAdaha, wa-aAAoothu bika min sharri hathihil-laylah, washarri ma baAAdaha, rabbi aAAoothu bika minal-kasal, wasoo-il kibar, rabbi aAAoothu bika min AAathabin fin-nar, waAAathabin fil-qabr.\n‘We have reached the morning and at this very time unto Allah belongs all sovereignty, and all praise is for Allah.  None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. My Lord, I ask You for the good of this night and the good of what follows it and I take refuge in You from the evil of this night and the evil of what follows it.  My Lord, I take refuge in You from laziness and senility.  My Lord, I take refuge in You from torment in the Fire and punishment in the grave.’\n",
      "enInfo": "",
      "groupId": 1,
      "id": 5,
      "repeat": 1
    },
    {
      "arAzkar": "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
      "arInfo": "",
      "enAzkar": "Allahumma anta rabbee la ilaha illa ant, khalaqtanee wa-ana AAabduk, wa-ana AAala AAahdika wawaAAdika mas-tataAAt, aAAoothu bika min sharri ma sanaAAt, aboo-o laka biniAAmatika AAalay, wa-aboo-o bithanbee, faghfir lee fa-innahu la yaghfiruth-thunooba illa ant.\n‘O Allah, You are my Lord, none has the right to be worshipped except You, You created me and I am Your servant and I abide to Your covenant and promise as best I can, I take refuge in You from the evil of which I have committed.  I acknowledge Your favour upon me and I acknowledge my sin, so forgive me, for verily none can forgive sin except You.’\n",
      "enInfo": "",
      "groupId": 1,
      "id": 6,
      "repeat": 1
    },
    {
      "arAzkar": "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
      "arInfo": "",
      "enAzkar": "Radeetu billahi rabban wabil-islami deenan wabiMuhammadin  nabiyya.\n‘I am pleased with Allah as a Lord, and Islam as a religion and Muhammad  as a Prophet.",
      "enInfo": "",
      "groupId": 1,
      "id": 7,
      "repeat": 1
    },
    {
      "arAzkar": "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك",
      "arInfo": "",
      "enAzkar": "Allahumma innee asbahtu oshhiduk, wa-oshhidu hamalata AAarshik, wamala-ikatak, wajameeAAa khalqik, annaka antal-lahu la ilaha illa ant, wahdaka la shareeka lak, wa-anna Muhammadan AAabduka warasooluk (four times in the morning and evening).\n‘O Allah, verily I have reached the morning and call on You, the bearers of Your throne, Your angles, and all of Your creation to witness that You are Allah, none has the right to be worshipped except You, alone, without partner and that Muhammad is Your Servant and Messenger.’\n(four times in the morning and evening.)",
      "enInfo": "",
      "groupId": 1,
      "id": 8,
      "repeat": 1
    },
    {
      "arAzkar": "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
      "arInfo": "",
      "enAzkar": "Allahumma ma asbaha bee min niAAmatin, aw bi-ahadin min khalqik, faminka wahdaka la shareeka lak, falakal-hamdu walakash-shukr.\n‘O Allah, what blessing I or any of Your creation have risen upon, is from You alone, without partner, so for You is all praise and unto You all thanks.’\n",
      "enInfo": "",
      "groupId": 1,
      "id": 9,
      "repeat": 1
    },
    {
      "arAzkar": "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم",
      "arInfo": "",
      "enAzkar": "Hasbiyal-lahu la ilaha illa huwa, AAalayhi tawakkalt, wahuwa rabbul-AAarshil-AAatheem (seven times morning and evening)\n‘Allah is Sufficient for me, none has the right to be worshipped except Him, upon Him I rely and He is Lord of the exalted throne.’\n(seven times morning and evening)",
      "enInfo": "",
      "groupId": 1,
      "id": 10,
      "repeat": 1
    },
    {
      "arAzkar": "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم",
      "arInfo": "",
      "enAzkar": "Bismil-lahil-lathee la yadurru maAAas-mihi shay-on fil-ardi wala fis-sama-i wahuwas-sameeAAul-AAaleem.\n‘In the name of Allah with whose name nothing is harmed on earth nor in the heavens and He is The All-Seeing, The All-Knowing.\n",
      "enInfo": "",
      "groupId": 1,
      "id": 11,
      "repeat": 1
    },
    {
      "arAzkar": "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
      "arInfo": "",
      "enAzkar": "Allahumma bika asbahna wabika amsayna, wabika nahya ,wabika namootu wa-ilaykan-nushoor.\n‘O Allah, by your leave we have reached the morning and by Your leave we have reached the evening, by Your leave we live and die and unto You is our resurrection.’\n",
      "enInfo": "",
      "groupId": 1,
      "id": 12,
      "repeat": 1
    },
    {
      "arAzkar": "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
      "arInfo": "",
      "enAzkar": "Asbahna AAala fitratil-islam, waAAala kalimatil-ikhlas, waAAala deeni nabiyyina Muhammad  waAAala millati abeena Ibraheem, haneefan musliman wama kana minal-mushrikeen.\n    ‘We rise upon the fitrah of Islam, and the word of pure faith, and upon the religion of our Prophet Muhammad  and the religion of our forefather Ibraheem, who was a Muslim and of true faith and was not of those who associate others with Allah.’\n    fitrah: the religion of Islam, the way of Ibraheem .\n    pure faith: the Shahada",
      "enInfo": "",
      "groupId": 1,
      "id": 13,
      "repeat": 1
    },
    {
      "arAzkar": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه .",
      "arInfo": "",
      "enAzkar": "Subhanal-lahi wabihamdih, AAadada khalqihi warida nafsih, wazinata AAarshih, wamidada kalimatih.(three times).\n‘How perfect Allah is and I praise Him by the number of His creation and His pleasure, and by the weight of His throne, and the ink of His words.’(three times)\n",
      "enInfo": "",
      "groupId": 1,
      "id": 14,
      "repeat": 1
    },
    {
      "arAzkar": "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ .",
      "arInfo": "",
      "enAzkar": "Allahumma innee aAAoothu bika minal-kufr, walfaqr, wa-aAAoothu bika min AAathabil-qabr, la ilaha illa ant (three times), ‘O Allah, I take refuge with You from disbelief and poverty, and I take refuge with You from the punishment of the grave.  None has the right to be worshipped except You.’ (three times)",
      "enInfo": "",
      "groupId": 1,
      "id": 15,
      "repeat": 1
    },
    {
      "arAzkar": "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
      "arInfo": "",
      "enAzkar": "Allahumma AAafinee fee badanee, allahumma AAafinee fee samAAee, allahumma AAafinee fee basaree, la ilaha illa ant.(three times).\n‘O Allah, grant my body health, O Allah, grant my hearing health, O Allah, grant my sight health.  None has the right to be worshipped except You.’\n(three times)\n‘O Allah, I take refuge with You from disbelief and poverty, and I take refuge with You from the punishment of the grave.  None has the right to be worshipped except You.’ (three times)\n",
      "enInfo": "",
      "groupId": 1,
      "id": 16,
      "repeat": 1
    },
    {
      "arAzkar": "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلُنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ .",
      "arInfo": "",
      "enAzkar": "Ya hayyu ya qayyoom, birahmatika astagheeth, aslih lee sha/nee kullah, wala takilnee ila nafsee tarfata AAayn.\n‘O Ever Living, O Self-Subsisting and Supporter of all, by Your mercy I seek assistance, rectify for me all of my affairs and do not leave me to myself, even for the blink of an eye.’\n",
      "enInfo": "",
      "groupId": 1,
      "id": 17,
      "repeat": 1
    },
    {
      "arAzkar": "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه . ",
      "arInfo": "",
      "enAzkar": "Asbahna wa-asbahal-mulku lillahi rabbil-AAalameen, allahumma innee as-aluka khayra hathal-yawm, fat-hahu, wanasrahu, wanoorahu, wabarakatahu, wahudahu, wa-aAAoothu bika min sharri ma feehi, washarri ma baAAdah.\n    ‘We have reached the morning and at this very time all sovereignty belongs to Allah, Lord of the worlds. O Allah, I ask You for the good of this day, its triumphs and its victories, its light and its blessings and its guidance, and I take refuge in You from the evil of this day and the evil that follows it.’\n    ",
      "enInfo": "",
      "groupId": 1,
      "id": 18,
      "repeat": 1
    },
    {
      "arAzkar": "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم .",
      "arInfo": "",
      "enAzkar": "Allahumma AAalimal-ghaybi washshahadah, fatiras-samawati wal-ard, rabba kulli shayin wamaleekah, ashhadu an la ilaha illa ant, aAAoothu bika min sharri nafsee wamin sharrish-shaytani washirkih, waan aqtarifa AAala nafsee soo-an aw ajurrahu ila muslim.\n‘O Allah, Knower of the unseen and the seen, Creator of the heavens and the Earth, Lord and Sovereign of all things, I bear witness that none has the right to be worshipped except You. I take refuge in You from the evil of my soul and from the evil and shirk of the devil, and from committing wrong against my soul or bringing such upon another Muslim.’\nshirk: to associate others with Allah in those things which are specific to Him.  This can occur in (1) belief, e.g. to believe that other than Allah has the power to benefit or harm, (2) speech, e.g. to swear by other than Allah and (3) action, e.g. to bow or prostrate to other than Allah.\n",
      "enInfo": "",
      "groupId": 1,
      "id": 19,
      "repeat": 1
    },
    {
      "arAzkar": "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق .",
      "arInfo": "",
      "enAzkar": "aAAoothu bikalimatil-lahit-tammati min sharri ma khalaq.\n‘I take refuge in Allah’s perfect words from the evil He has created.’",
      "enInfo": "",
      "groupId": 1,
      "id": 20,
      "repeat": 1
    },
    {
      "arAzkar": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.\nمن صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة .",
      "arInfo": "",
      "enAzkar": "God blessings and peace upon our Prophet Muhammad",
      "enInfo": "",
      "groupId": 1,
      "id": 21,
      "repeat": 10
    },
    {
      "arAzkar": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
      "arInfo": "",
      "enAzkar": "",
      "enInfo": "",
      "groupId": 1,
      "id": 22,
      "repeat": 1
    },
    {
      "arAzkar": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ .",
      "arInfo": "",
      "enAzkar": "Allahumma innee aAAoothu bika minal-hammi walhuzn, walAAajzi walkasali walbukhli waljubn, wadalAAid-dayni waghalabatir-rijal.\n‘O Allah, I take refuge in You from anxiety and sorrow, weakness and laziness, miserliness and cowardice, the burden of debts and from being over powered by men.’\n",
      "enInfo": "",
      "groupId": 1,
      "id": 23,
      "repeat": 3
    },
    {
      "arAzkar": "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
      "arInfo": "",
      "enAzkar": "Astaghfirul-lahal-lathee la ilaha illa huwal-hayyul-qayyoomu wa-atoobu ilayh.\n‘I seek Allah’s forgiveness, besides whom, none has the right to be worshipped except He, The Ever Living, The Self-Subsisting and Supporter of all, and I turn to Him in repentance.’\n",
      "enInfo": "",
      "groupId": 1,
      "id": 24,
      "repeat": 3
    },
    {
      "arAzkar": "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ",
      "arInfo": "",
      "enAzkar": "‘Ya Rabb! Lakal-hamdu kama yanbagi li-jalali Wajhika wa li ‘azima sultanika (O Lord, to You is praise as befits the Glory of Your Face and the greatness of Your Might.)‘",
      "enInfo": "",
      "groupId": 1,
      "id": 25,
      "repeat": 1
    },
    {
      "arAzkar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا .",
      "arInfo": "",
      "enAzkar": ">Allahumma innee as-aluka AAilman nafiAAan, warizqan tayyiban, waAAamalan mutaqabbalan.(after salam from fajr prayer).\n‘O Allah, I ask You for knowledge which is beneficial and sustenance which is good, and deeds which are acceptable.’\n",
      "enInfo": "",
      "groupId": 1,
      "id": 26,
      "repeat": 1
    },
    {
      "arAzkar": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
      "arInfo": "",
      "enAzkar": "‘Allah-humma, anta rabbi, laa ilaaha illaa Anta, ‘alaika tawakkaltu wa anta rabbul ‘arshil kareem maashaa Allahu kaana wa maLam yasha‘ lam yakun-wa laa hawla wa lla quwwata illaa bil-Laahil A‘liyyil ‘Atheem. A‘lamu annallaaha ‘alaa kulli shay in qadiyrun-wa annallaaha qad ahaata bikulli shay in ilmaa. Allah-humma inni a‘uthu bika min sharri nafsiy wa min sharri kulli daabbatin ants aakhithum bi naasiyatihaa inna rabiy ‘alaa siraatim mustaqiym.‘\n(Oh Allah, You are my Lord. There is nothing worthy of worship except You. I place all of my trust and reliance in You and You are the Lord of the Noble Throne. Whatever Allah wishes takes place, and whatever He does not desire, does not occur, and there is no power and no strength except in Allah, The Exalted, The Mighty. I know that Allah is Powerful over all things and that Allah has knowledge of all things. Oh Allah, I seek refuge in You from the evil of my nafs (self) and from the evil of every crawling creature. You are master over them. Verily, You are Lord of the Straight Path.)</string>\n",
      "enInfo": "",
      "groupId": 1,
      "id": 27,
      "repeat": 1
    },
    {
      "arAzkar": "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ.",
      "arInfo": "",
      "enAzkar": "La ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shay-in qadeer.\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, and He is over all things omnipotent.’\n",
      "enInfo": "",
      "groupId": 1,
      "id": 28,
      "repeat": 1
    },
    {
      "arAzkar": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
      "arInfo": "",
      "enAzkar": "Subhanal-lahi wabihamdih.\n‘How perfect Allah is and I praise Him.’",
      "enInfo": "",
      "groupId": 1,
      "id": 29,
      "repeat": 100
    },
    {
      "arAzkar": "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ .",
      "arInfo": "",
      "enAzkar": "Astaghfirul-lahal- wa-atoobu ilayh.\n‘I seek Allah’s forgiveness and I turn to Him in repentance.’",
      "enInfo": "",
      "groupId": 1,
      "id": 30,
      "repeat": 3
    },
    {
      "arAzkar": "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. آية الكرسى - البقرة 255.",
      "arInfo": "",
      "enAzkar": "It is from the sunnah to recite the verse of the Footstool (Ayat-Al-Kursiy) after each prayer:{Allahu la ilaha illa huwa alhayyu alqayyoomu la ta/khuthuhu sinatun wala nawm…}\nAl-Baqarah:255",
      "enInfo": "",
      "groupId": 2,
      "id": 31,
      "repeat": 1
    },
    {
      "arAzkar": "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nآمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. البقرة 285 - 286.",
      "arInfo": "",
      "enAzkar": "(Amana alrrasoolu bima onzila ilayhi min rabbihi wa almu/minoona….)\nAl-Baqarah: 285-286",
      "enInfo": "The Prophet  also said: ‘Whoever recites the last two verses of Soorat Al-Baqarah at night, those two verses shall be sufficient for him (i.e. protect him from all that can cause him harm)",
      "groupId": 2,
      "id": 32,
      "repeat": 1
    },
    {
      "arAzkar": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
      "arInfo": "",
      "enAzkar": "{Qul huwa Allahu ahad…}\tAl-Ikhlasٌ",
      "enInfo": "",
      "groupId": 2,
      "id": 33,
      "repeat": 3
    },
    {
      "arAzkar": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
      "arInfo": "",
      "enAzkar": "{Qul aAAoothu birabbi alfalaq…..}\tAl-Falaq",
      "enInfo": "",
      "groupId": 2,
      "id": 34,
      "repeat": 3
    },
    {
      "arAzkar": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
      "arInfo": "",
      "enAzkar": "{Qul aAAoothu birabbi alnnas…..}\tAn-Nas",
      "enInfo": "",
      "groupId": 2,
      "id": 35,
      "repeat": 3
    },
    {
      "arAzkar": "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
      "arInfo": "",
      "enAzkar": "Amsayna wa-amsal-mulku lillah walhamdu lillah la ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer, rabbi as-aluka khayra ma fee hathihil-laylah, wakhayra ma baAAdaha, wa-aAAoothu bika min sharri hathihil-laylah, washarri ma baAAdaha, rabbi aAAoothu bika minal-kasal, wasoo-il kibar, rabbi aAAoothu bika min AAathabin fin-nar, waAAathabin fil-qabr.\n‘We have reached the evening and at this very time unto Allah belongs all sovereignty, and all praise is for Allah.  None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. My Lord, I ask You for the good of this night and the good of what follows it and I take refuge in You from the evil of this night and the evil of what follows it.  My Lord, I take refuge in You from laziness and senility.  My Lord, I take refuge in You from torment in the Fire and punishment in the grave.’\n",
      "enInfo": "",
      "groupId": 2,
      "id": 36,
      "repeat": 1
    },
    {
      "arAzkar": "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
      "arInfo": "",
      "enAzkar": "Allahumma anta rabbee la ilaha illa ant, khalaqtanee wa-ana AAabduk, wa-ana AAala AAahdika wawaAAdika mas-tataAAt, aAAoothu bika min sharri ma sanaAAt, aboo-o laka biniAAmatika AAalay, wa-aboo-o bithanbee, faghfir lee fa-innahu la yaghfiruth-thunooba illa ant.\n‘O Allah, You are my Lord, none has the right to be worshipped except You, You created me and I am Your servant and I abide to Your covenant and promise as best I can, I take refuge in You from the evil of which I have committed.  I acknowledge Your favour upon me and I acknowledge my sin, so forgive me, for verily none can forgive sin except You.’\n",
      "enInfo": "",
      "groupId": 2,
      "id": 37,
      "repeat": 1
    },
    {
      "arAzkar": "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
      "arInfo": "",
      "enAzkar": "Radeetu billahi rabban wabil-islami deenan wabiMuhammadin  nabiyya.\n‘I am pleased with Allah as a Lord, and Islam as a religion and Muhammad  as a Prophet.",
      "enInfo": "",
      "groupId": 2,
      "id": 38,
      "repeat": 3
    },
    {
      "arAzkar": "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.\nمن قالها أعتقه الله من النار.",
      "arInfo": "",
      "enAzkar": "Allahumma innee amsaytu oshhiduk, wa-oshhidu hamalata AAarshik, wamala-ikatak, wajameeAAa khalqik, annaka antal-lahu la ilaha illa ant, wahdaka la shareeka lak, wa-anna Muhammadan AAabduka warasooluk (four times in the morning and evening).\n‘O Allah, verily I have reached the evening and call on You, the bearers of Your throne, Your angles, and all of Your creation to witness that You are Allah, none has the right to be worshipped except You, alone, without partner and that Muhammad is Your Servant and Messenger.’\n",
      "enInfo": "",
      "groupId": 2,
      "id": 39,
      "repeat": 4
    },
    {
      "arAzkar": "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
      "arInfo": "",
      "enAzkar": "Allahumma ma amsa bee min niAAmatin, aw bi-ahadin min khalqik, faminka wahdaka la shareeka lak, falakal-hamdu walakash-shukr.\n‘O Allah, what blessing I or any of Your creation have reached the evening, is from You alone, without partner, so for You is all praise and unto You all thanks.’\n",
      "enInfo": "",
      "groupId": 2,
      "id": 40,
      "repeat": 1
    },
    {
      "arAzkar": "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
      "arInfo": "",
      "enAzkar": "Hasbiyal-lahu la ilaha illa huwa, AAalayhi tawakkalt, wahuwa rabbul-AAarshil-AAatheem (seven times morning and evening)\n‘Allah is Sufficient for me, none has the right to be worshipped except Him, upon Him I rely and He is Lord of the exalted throne.’\n(seven times morning and evening)",
      "enInfo": "",
      "groupId": 2,
      "id": 41,
      "repeat": 7
    },
    {
      "arAzkar": "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
      "arInfo": "",
      "enAzkar": "Bismil-lahil-lathee la yadurru maAAas-mihi shay-on fil-ardi wala fis-sama-i wahuwas-sameeAAul-AAaleem.\n‘In the name of Allah with whose name nothing is harmed on earth nor in the heavens and He is The All-Seeing, The All-Knowing.",
      "enInfo": "",
      "groupId": 2,
      "id": 42,
      "repeat": 3
    },
    {
      "arAzkar": "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.",
      "arInfo": "",
      "enAzkar": "Allahumma bika amsayna, wabika asbahna, wabika nahya wabika namootu wa-ilaykal-maseer.\n‘O Allah, by Your leave we have reached the evening and by Your leave we have reached the morning, by Your leave we live and die and unto You is our return.’\n",
      "enInfo": "",
      "groupId": 2,
      "id": 43,
      "repeat": 3
    },
    {
      "arAzkar": "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
      "arInfo": "",
      "enAzkar": "Amsayna AAala fitratil-islam, waAAala kalimatil-ikhlas, waAAala deeni nabiyyina Muhammad  waAAala millati abeena Ibraheem, haneefan musliman wama kana minal-mushrikeen.\n‘We have reached the evening upon the fitrah of Islam, and the word of pure faith, and upon the religion of our Prophet Muhammad  and the religion of our forefather Ibraheem, who was a Muslim and of true faith and was not of those who associate others with Allah.’\nfitrah: the religion of Islam, the way of Ibraheem .\npure faith: the Shahada.",
      "enInfo": "",
      "groupId": 2,
      "id": 44,
      "repeat": 1
    },
    {
      "arAzkar": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
      "arInfo": "",
      "enAzkar": "Subhanal-lahi wabihamdih, AAadada khalqihi warida nafsih, wazinata AAarshih, wamidada kalimatih.(three times).\n‘How perfect Allah is and I praise Him by the number of His creation and His pleasure, and by the weight of His throne, and the ink of His words.’(three times)\n",
      "enInfo": "",
      "groupId": 2,
      "id": 45,
      "repeat": 3
    },
    {
      "arAzkar": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
      "arInfo": "",
      "enAzkar": "Allahumma AAafinee fee badanee, allahumma AAafinee fee samAAee, allahumma AAafinee fee basaree, la ilaha illa ant.(three times).\n‘O Allah, grant my body health, O Allah, grant my hearing health, O Allah, grant my sight health.  None has the right to be worshipped except You.’\n(three times)",
      "enInfo": "",
      "groupId": 2,
      "id": 46,
      "repeat": 3
    },
    {
      "arAzkar": "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
      "arInfo": "Allahumma innee aAAoothu bika minal-kufr, walfaqr, wa-aAAoothu bika min AAathabil-qabr, la ilaha illa ant (three times), ‘O Allah, I take refuge with You from disbelief and poverty, and I take refuge with You from the punishment of the grave.  None has the right to be worshipped except You.’ (three times)",
      "enAzkar": "",
      "enInfo": "",
      "groupId": 2,
      "id": 47,
      "repeat": 3
    },
    {
      "arAzkar": "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
      "arInfo": "",
      "enAzkar": "Allahumma innee as-alukal-AAafwa walAAafiyah, fid-dunya wal-akhirah, allahumma innee as-alukal-AAafwa walAAafiyah fee deenee, wadunyaya wa-ahlee, wamalee, allahummas-tur AAawratee, wa-amin rawAAatee, allahummah-fathnee min bayni yaday, wamin khalfee, waAAan yameenee, waAAan shimalee, wamin fawqee, wa-aAAoothu biAAathamatika an oghtala min tahtee.\n‘O Allah, I ask You for pardon and well-being in this life and the next. O Allah, I ask You for pardon and well-being in my religious and worldly affairs, and my family and my wealth. O Allah, veil my weaknesses and set at ease my dismay. O Allah, preserve me from the front and from behind and on my right and on my left and from above, and I take refuge with You lest I be swallowed up by the earth.’\n",
      "enInfo": "",
      "groupId": 2,
      "id": 48,
      "repeat": 1
    },
    {
      "arAzkar": "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلُنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
      "arInfo": "",
      "enAzkar": "Ya hayyu ya qayyoom, birahmatika astagheeth, aslih lee sha/nee kullah, wala takilnee ila nafsee tarfata AAayn.\n‘O Ever Living, O Self-Subsisting and Supporter of all, by Your mercy I seek assistance, rectify for me all of my affairs and do not leave me to myself, even for the blink of an eye.’\n",
      "enInfo": "",
      "groupId": 2,
      "id": 49,
      "repeat": 3
    },
    {
      "arAzkar": "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا.",
      "arInfo": "",
      "enAzkar": "Amsayna wa-amsal-mulku lillahi rabbil-AAalameen, allahumma innee as-aluka khayra hathihil-laylah, fat-haha, wanasraha, wanooraha, wabarakataha, wahudaha, wa-aAAoothu bika min sharri ma feeha washarri ma baAAdaha.\n‘We have reached the evening and at this very time all sovereignty belongs to Allah, Lord of the worlds. O Allah, I ask You for the good of tonight, its triumphs and its victories, its light and its blessings and its guidance, and I take refuge in You from the evil of tonight and the evil that follows it.’\n",
      "enInfo": "",
      "groupId": 2,
      "id": 50,
      "repeat": 3
    },
    {
      "arAzkar": "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
      "arInfo": "",
      "enAzkar": "Allahumma AAalimal-ghaybi washshahadah, fatiras-samawati wal-ard, rabba kulli shayin wamaleekah, ashhadu an la ilaha illa ant, aAAoothu bika min sharri nafsee wamin sharrish-shaytani washirkih, waan aqtarifa AAala nafsee soo-an aw ajurrahu ila muslim.\n‘O Allah, Knower of the unseen and the seen, Creator of the heavens and the Earth, Lord and Sovereign of all things, I bear witness that none has the right to be worshipped except You. I take refuge in You from the evil of my soul and from the evil and shirk of the devil, and from committing wrong against my soul or bringing such upon another Muslim.’\nshirk: to associate others with Allah in those things which are specific to Him.  This can occur in (1) belief, e.g. to believe that other than Allah has the power to benefit or harm, (2) speech, e.g. to swear by other than Allah and (3) action, e.g. to bow or prostrate to other than Allah.\n",
      "enInfo": "",
      "groupId": 2,
      "id": 51,
      "repeat": 1
    },
    {
      "arAzkar": "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
      "arInfo": "",
      "enAzkar": "aAAoothu bikalimatil-lahit-tammati min sharri ma khalaq. (three times in the evening).\n‘I take refuge in Allah’s perfect words from the evil He has created.’\n(three times in the evening)",
      "enInfo": "",
      "groupId": 2,
      "id": 52,
      "repeat": 3
    },
    {
      "arAzkar": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
      "arInfo": "",
      "enAzkar": "God blessings and peace upon our Prophet Muhammad",
      "enInfo": "",
      "groupId": 2,
      "id": 53,
      "repeat": 10
    },
    {
      "arAzkar": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
      "arInfo": "",
      "enAzkar": "",
      "enInfo": "",
      "groupId": 2,
      "id": 54,
      "repeat": 3
    },
    {
      "arAzkar": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
      "arInfo": "",
      "enAzkar": "Allahumma innee aAAoothu bika minal-hammi walhuzn, walAAajzi walkasali walbukhli waljubn, wadalAAid-dayni waghalabatir-rijal.\n‘O Allah, I take refuge in You from anxiety and sorrow, weakness and laziness, miserliness and cowardice, the burden of debts and from being over powered by men.’\n",
      "enInfo": "",
      "groupId": 2,
      "id": 55,
      "repeat": 3
    },
    {
      "arAzkar": "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
      "arInfo": "",
      "enAzkar": "Astaghfirul-lahal-lathee la ilaha illa huwal-hayyul-qayyoomu wa-atoobu ilayh.\n‘I seek Allah’s forgiveness, besides whom, none has the right to be worshipped except He, The Ever Living, The Self-Subsisting and Supporter of all, and I turn to Him in repentance.’\n",
      "enInfo": "",
      "groupId": 2,
      "id": 56,
      "repeat": 3
    },
    {
      "arAzkar": "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
      "arInfo": "",
      "enAzkar": "‘Ya Rabb! Lakal-hamdu kama yanbagi li-jalali Wajhika wa li ‘azima sultanika (O Lord, to You is praise as befits the Glory of Your Face and the greatness of Your Might.)",
      "enInfo": "",
      "groupId": 2,
      "id": 57,
      "repeat": 3
    },
    {
      "arAzkar": "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ.",
      "arInfo": "",
      "enAzkar": "La ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shay-in qadeer.\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, and He is over all things omnipotent.",
      "enInfo": "",
      "groupId": 2,
      "id": 58,
      "repeat": 10
    },
    {
      "arAzkar": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
      "arInfo": "",
      "enAzkar": "‘Allah-humma, anta rabbi, laa ilaaha illaa Anta, ‘alaika tawakkaltu wa anta rabbul ‘arshil kareem maashaa Allahu kaana wa maLam yasha‘ lam yakun-wa laa hawla wa lla quwwata illaa bil-Laahil A‘liyyil ‘Atheem. A‘lamu annallaaha ‘alaa kulli shay in qadiyrun-wa annallaaha qad ahaata bikulli shay in ilmaa. Allah-humma inni a‘uthu bika min sharri nafsiy wa min sharri kulli daabbatin ants aakhithum bi naasiyatihaa inna rabiy ‘alaa siraatim mustaqiym.‘\n(Oh Allah, You are my Lord. There is nothing worthy of worship except You. I place all of my trust and reliance in You and You are the Lord of the Noble Throne. Whatever Allah wishes takes place, and whatever He does not desire, does not occur, and there is no power and no strength except in Allah, The Exalted, The Mighty. I know that Allah is Powerful over all things and that Allah has knowledge of all things. Oh Allah, I seek refuge in You from the evil of my nafs (self) and from the evil of every crawling creature. You are master over them. Verily, You are Lord of the Straight Path.)",
      "enInfo": "",
      "groupId": 2,
      "id": 59,
      "repeat": 1
    },
    {
      "arAzkar": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
      "arInfo": "",
      "enAzkar": "Subhanal-lahi wabihamdih.  (one hundred times)\n‘How perfect Allah is and I praise Him.’(one hundred times)",
      "enInfo": "Abu Huraira reported Allah's Messenger (ﷺ) as saying: He who recites in the morning and in the evening (these words):\\\" Hallowed be Allah and all praise is due to Him\\\" one hundred times, he would not bring on the Day of Resurrection anything excellent than this except one who utters these words or utters more than these words.",
      "groupId": 2,
      "id": 60,
      "repeat": 100
    },
    {
      "arAzkar": "اللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا، وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا، وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا، وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا .اللّهُـمَّ أَعْطِنـي نورا.",
      "arInfo": "دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ ",
      "enAzkar": "Allahumma ijAAal fee qalbee noora, wafee lisanee noora, wajAAal fee samAAee noora,wajAAal fee basaree noora, wajAAal min khalfee noora, wamin amamee noora ,wajAAal min fawqee noora, wamin tahtee noora, allahumma aAAtinee noora.\n‘O Allah, place within my heart light, and upon my tongue light, and within my ears light, and within my eyes light, and place behind me light and in front of me light and above me light and beneath me light.  O Allah, bestow upon me light.’\n",
      "enInfo": "Supplication when going to the mosque",
      "groupId": 3,
      "id": 61,
      "repeat": 1
    },
    {
      "arAzkar": "يَبْدَأُ بِرِجْلِهِ اليُمْنَى، وَيَقُولُ:\nأَعوذُ باللهِ العَظيـم وَبِوَجْهِـهِ الكَرِيـم وَسُلْطـانِه القَديـم مِنَ الشّيْـطانِ الرَّجـيم، بِسْمِ اللَّهِ، وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ الله، اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك",
      "arInfo": "دُعَاءُ دُخُولِ المَسْجدِ ",
      "enAzkar": "aAAoothu billahil-AAatheem wabiwajhihil-kareem wasultanihil-qadeem minash-shaytanir-rajeem, bismil-lah, wassalatu wassalamu AAala rasoolil-lah , allahumma iftah lee abwaba rahmatik.\n‘I take refuge with Allah, The Supreme and with His Noble Face, and His eternal authority from the accursed devil. In the name of Allah, and prayers and peace be upon the Messenger of Allah.  O Allah, open the gates of Your mercy for me.’\n",
      "enInfo": "Upon entering the mosqueِ",
      "groupId": 3,
      "id": 62,
      "repeat": 1
    },
    {
      "arAzkar": "يَبْدَأُ بِرِجْلِهِ الْيُسْرَى، وَيَقُولُ:\nبِسْـمِ اللَّـهِ وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيم.\n",
      "arInfo": "دُعَاءُ الخُرُوجِ مِنَ المَسْجدِ ",
      "enAzkar": "Bismil-lah wassalatu wassalamu AAala rasoolil-lah, allahumma innee as-aluka min fadlik, allahumma iAAsimnee minash-shaytanir-rajeem.\n‘In the name of Allah, and prayers and peace be upon the Messenger of Allah.  O Allah, I ask You from Your favour.  O Allah, guard me from the accursed devil.’\n",
      "enInfo": "Upon leaving the mosque",
      "groupId": 3,
      "id": 63,
      "repeat": 1
    },
    {
      "arAzkar": "بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا.",
      "arInfo": "أذكار دخول وخروج المنزل",
      "enAzkar": "Bismil-lahi walajna, wabismil-lahi kharajna, waAAala rabbina tawakkalna.\n‘In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we place our trust.’",
      "enInfo": "Upon entering the home",
      "groupId": 4,
      "id": 64,
      "repeat": 1
    },
    {
      "arAzkar": "بِسْمِ اللهِ ، تَوَكَّلْـتُ عَلى اللهِ وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله.\nاللّهُـمَّ إِنِّـي أَعـوذُ بِكَ أَنْ أَضِـلَّ أَوْ أُضَـل ، أَوْ أَزِلَّ أَوْ أُزَل ، أَوْ أَظْلِـمَ أَوْ أَُظْلَـم ، أَوْ أَجْهَلَ أَوْ يُـجْهَلَ عَلَـيّ.",
      "arInfo": "أذكار الخروج من المنزل",
      "enAzkar": "Bismil-lah, tawakkaltu AAalal-lah, wala hawla wala quwwata illa billah.\n‘In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah.’\nAllahumma innee aAAoothu bika an adilla aw odal, aw azilla aw ozall, aw athlima aw othlam, aw ajhala aw yujhala AAalay.\n‘O Allah, I take refuge with You lest I should stray or be led astray, or slip or be tripped, or oppress or be oppressed, or behave foolishly or be treated foolishly.’\nslip: i.e. to commit a sin unintentionally",
      "enInfo": "When leaving the home",
      "groupId": 4,
      "id": 65,
      "repeat": 1
    },
    {
      "arAzkar": "اللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللهم نَقِّنِيْ مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأبْيَضُ مِنَ الدَّنَسِ، اللهم اغْسِلْنِيْ مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ والْبَرَدِ.",
      "arInfo": "أدعية استفتاح الصلاة",
      "enAzkar": "O Allaah, distance me from my sins just as You have distanced The East from The West, O Allaah, purify me of my sins as a white robe is purified of filth, O Allaah, cleanse me of my sins with snow, water, and ice.",
      "enInfo": "Supplication at the start of the prayer (after takbeer)",
      "groupId": 5,
      "id": 66,
      "repeat": 1
    },
    {
      "arAzkar": "سُبْحَانَكَ سُبْحَانَكَ اللهم وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ.",
      "arInfo": "أدعية استفتاح الصلاة",
      "enAzkar": "How perfect You are O Allaah, and I praise You. Blessed be Your name, and lofty is Your position and none has the right to be worshipped except You.",
      "enInfo": "",
      "groupId": 5,
      "id": 67,
      "repeat": 1
    },
    {
      "arAzkar": "الْحَمْدُ للّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.",
      "arInfo": "أدعية استفتاح الصلاة",
      "enAzkar": "Our Lord, for You is all praise, an abundant beautiful blessed praise.",
      "enInfo": "Supplication at the start of the prayer (after takbeer)",
      "groupId": 5,
      "id": 68,
      "repeat": 1
    },
    {
      "arAzkar": "اللهُ أكْبَرُ كَبِيْرًا، وَالْحَمْدُ لِلهِ كَثِيْرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَّاصِيْلًا. أعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ.",
      "arInfo": "أدعية استفتاح الصلاة",
      "enAzkar": "Allaah is Most Great, Allaah is Most Great, much praise is for Allaah, much praise is for Allaah, much praise is for Allaah, and I declare the perfection of Allaah in the early morning and in the late afternoon.I take refuge with Allaah from the devil, from the his pride, his poetry and his madness.",
      "enInfo": "Supplication at the start of the prayer (after takbeer)",
      "groupId": 5,
      "id": 69,
      "repeat": 3
    },
    {
      "arAzkar": "اللَّهُمَّ رَبَّ جَبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيْلَ، فَاطِرَ السَّمَوَاتِ وَالْأرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْمَا كَانُوا فِيْهِ يَخْتَلِفُونَ، اِهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِيْ مَنْ تَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيْمٍ.",
      "arInfo": "أدعية استفتاح الصلاة",
      "enAzkar": "O Allaah, Lord of Jibraa’eel, Meekaa’eel and Israafeel (great angels), Creator of the heavens and the Earth, Knower of the seen and the unseen. You are the arbitrator between Your servants in that which they have disputed. Guide me to the truth by Your leave, in that which they have differed, for verily You guide whom You will to a straight path.",
      "enInfo": "Supplication at the start of the prayer (after takbeer)",
      "groupId": 5,
      "id": 70,
      "repeat": 1
    },
    {
      "arAzkar": "وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمَوَاتِ وَالْأرْضَ حَنِيْفًا وَّمَا أنَا مِنَ الْمُشْرِكِيْنَ، إِنَّ صَلَاتِيْ، وَنُسُكِيْ، وَمَحْيَايَ، وَمَمَاتِيْ لِلهِ رَبِّ الْعَالَمِيْنَ، لَا شَرِيْكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَانَا مِنَ الْمُسْلِمِيْنَ، اللهم أنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أنْتَ، أنْتَ رَبِّيْ وَأنَا عَبْدُكَ، ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ فَاغْفِرْ لِيْ ذُنُوْبِيْ جَمِيْعًا إِنَّهُ لَا يَغْفِرُ الذُّنوبَ إِلَّا أنْتَ. وَاهْدِنِيْ لِأحْسَنِ الْأخْلَاقِ لَا يَهْدِيْ لِأحْسَنِهَا إِلَّا أنْتَ، وَاصْرِفْ عَنِّيْ سَيِّئَهَا، لَا يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلَّا أنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أسْتَغْفِرُكَ وَأتُوْبُ إِلَيْكَ.",
      "arInfo": "أدعية استفتاح الصلاة",
      "enAzkar": "I have turned my face sincerely towards He who has brought forth the heavens and the Earth and I am not of those who associate (others with Allaah). Indeed my prayer, my sacrifice, my life and my death are for Allaah, Lord of the worlds, no partner has He, with this I am commanded and I am of the Muslims. O Allaah, You are the Sovereign, none has the right to be worshiped except You. You are my Lord and I am Your servant, I have wronged my own soul and have acknowledged my sin, so forgive me all my sins for no one forgives sins except You. Guide me to the best of characters for none can guide to it other than You, and deliver me from the worst of characters for none can deliver me from it other than You. Here I am, in answer to Your call, happy to serve you. All good is within Your hands and evil does not stem from You. I exist by your will and will return to you. Blessed and High are You, I seek Your forgiveness and repent unto You.",
      "enInfo": "Supplication at the start of the prayer (after takbeer)",
      "groupId": 5,
      "id": 71,
      "repeat": 1
    },
    {
      "arAzkar": "سُبْحانَ رَبِّيَ الْعَظِيْمِ.",
      "arInfo": "أدعية الركوع",
      "enAzkar": "How perfect my Lord is, The Supreme.",
      "enInfo": "While bowing in prayer (rukuu’)",
      "groupId": 5,
      "id": 72,
      "repeat": 1
    },
    {
      "arAzkar": "سُبْحَانَ رَبِّيَ العَظِيمِ وَبِحَمْدِهِ.",
      "arInfo": "أدعية الركوع",
      "enAzkar": "How perfect my Lord is, The Supreme,and I praise You",
      "enInfo": "While bowing in prayer (rukuu’)",
      "groupId": 5,
      "id": 73,
      "repeat": 1
    },
    {
      "arAzkar": "سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي",
      "arInfo": "أدعية الركوع",
      "enAzkar": "How perfect You are O Allaah, our Lord and I praise You. O Allaah, forgive me.",
      "enInfo": "While bowing in prayer (rukuu’)",
      "groupId": 5,
      "id": 74,
      "repeat": 1
    },
    {
      "arAzkar": "سُبُّوُحٌ ، قُدُّوسٌ، رَبُّ المَلَائِكَةِ وَالرُّوْحِ.",
      "arInfo": "أدعية الركوع",
      "enAzkar": "Perfect and Holy (He is), Lord of the angels and the Ruuh (i.e. Jibraa’eel).",
      "enInfo": "While bowing in prayer (rukuu’)",
      "groupId": 5,
      "id": 75,
      "repeat": 1
    },
    {
      "arAzkar": "سُبْحَانَ ذِيْ الْجَبَرُوْتِ، وَالْمَلَكُوْتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ.",
      "arInfo": "أدعية الركوع",
      "enAzkar": "How perfect He is, The Possessor of total power, sovereignty, magnificence and grandeur.",
      "enInfo": "While bowing in prayer (rukuu’)",
      "groupId": 5,
      "id": 76,
      "repeat": 1
    },
    {
      "arAzkar": "اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي وَبَصَرِي، وَمُخِّي وَعَظْمِي وَعَصَبِي",
      "arInfo": "أدعية الركوع",
      "enAzkar": "O Allaah, unto You I have bowed, and in You I have believed, and to You I have submitted. My hearing, sight, mind, bones, tendons and what my feet carry are humbled before You.",
      "enInfo": "While bowing in prayer (rukuu’)",
      "groupId": 5,
      "id": 77,
      "repeat": 1
    },
    {
      "arAzkar": "سُبْحَانَ رَبِّيَ الأَعْلَى",
      "arInfo": "أدعية السجود",
      "enAzkar": "How perfect my Lord is, The Most High.’ (three times)",
      "enInfo": "Supplication whilst prostrating (sujuud)",
      "groupId": 5,
      "id": 78,
      "repeat": 1
    },
    {
		"arAzkar": "سُبْحَانَ رَبِّيَ الأعْلَى وَبِحَمْدِه",
		"arInfo": "أدعية السجود",
		"enAzkar": "How perfect my Lord is, The Most High,and i praise you",
		"enInfo": "Supplication whilst prostrating (sujuud)",
		"groupId": 5,
		"id": 79,
		"repeat": 1
	}, {
		"arAzkar": "سُبُّوُحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ.",
		"arInfo": "أدعية السجود",
		"enAzkar": "Perfect and Holy (He is), Lord of the angels and the Ruuh (i.e. Jibraa’eel).",
		"enInfo": "Supplication whilst prostrating (sujuud)",
		"groupId": 5,
		"id": 80,
		"repeat": 1
	}, {
		"arAzkar": "سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي.",
		"arInfo": "أدعية السجود",
		"enAzkar": "How perfect You are O Allaah, our Lord, and I praise You. O Allaah, forgive me.",
		"enInfo": "Supplication whilst prostrating (sujuud)",
		"groupId": 5,
		"id": 81,
		"repeat": 1
	}, {
		"arAzkar": "سُبْحَانَ ذِي الْجَبْرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ.",
		"arInfo": "أدعية السجود",
		"enAzkar": "How perfect He is, The Possessor of total power, sovereignty, magnificence and grandeur.",
		"enInfo": "Supplication whilst prostrating (sujuud)",
		"groupId": 5,
		"id": 82,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَتَهُ وَسِرَّهُ",
		"arInfo": "أدعية السجود",
		"enAzkar": "O Allaah, forgive me all of my sins, the smaal and great of them, the first and last of them, and the seen and hidden of them.",
		"enInfo": "Supplication whilst prostrating (sujuud)",
		"groupId": 5,
		"id": 83,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ لَكَ سَجَدْتُّ وَبِكَ آمَنْتُ، وَلَكَ أسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِيْ خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللهُ أحْسَنُ الْخَالِقيْن",
		"arInfo": "أدعية السجود",
		"enAzkar": "O Allaah, unto You I have prostrated and in You I have believed, and unto You I have submitted. My face has prostrated before He Who created it and fashioned it, and brought forth its faculties of hearing and seeing. Blessed is Allaah, the Best of creators.",
		"enInfo": "Supplication whilst prostrating (sujuud)",
		"groupId": 5,
		"id": 84,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ إِنِّيْ أعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقوْبَتِكَ، وَأعُوْذُ بِكَ مِنْكَ، لَا أُحْصِـي ثَنَاءً عَلَيْكَ، أنْتَ كَمَا أثْنَيْتَ عَلَى نَفْسِكَ.",
		"arInfo": "أدعية السجود",
		"enAzkar": "O Allaah, I take refuge within Your pleasure from Your displeasure and within Your pardon from Your punishment, and I take refuge in You from You. I cannot enumerate Your praise. You are as You have praised Yourself.",
		"enInfo": "Supplication whilst prostrating (sujuud)",
		"groupId": 5,
		"id": 85,
		"repeat": 1
	}, {
		"arAzkar": "رَبِّ اعْطِ نَفْسِي تَقْوَاهَا زَكِّهَا أنْتَ خَيْرُ مَنْ زَكَّاهَا أنْتَ وَلِيُّهَا وَمَوْلَاهَا.",
		"arInfo": "أدعية السجود",
		"enAzkar": " O Allah, make my soul obedient and purify it, for You are the best One to purify it, You are its Guardian and Lord.",
		"enInfo": "Supplication whilst prostrating (sujuud)",
		"groupId": 5,
		"id": 86,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَاجْعَلْ فِيْ سَمْعِيْ نُورًا وَاجْعَلْ فِيْ بَصَرِيْ نُورًا وَاجْعَلْ مِنْ تَحْتِي نُورًا وَاجْعَلْ مِنْ فَوْقِي نُورًا وَعَنْ يَمِينِي نُورًا وَعَنْ يَسَارِي نُورًا وَاجْعَلْ أمَامِي نُورًا وَاجْعَلْ خَلْفِي نُورًا وَأعْظِمْ لِيْ نُورًا.",
		"arInfo": "أدعية السجود",
		"enAzkar": "O Allaah, place within my heart light, and upon my tongue light, and within my ears light, and within my eyes light, and place behind me light and in front of me light and above me light and beneath me light. O Allaah, bestow upon me light.",
		"enInfo": "Supplication whilst prostrating (sujuud)",
		"groupId": 5,
		"id": 87,
		"repeat": 1
	}, {
		"arAzkar": "بعد أن يختار أحد أدعية السجود ، يسن له أن يدعوا بما شاء ،لأن أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ، فَأَكْثِرُوا الدُّعَاءَ",
		"arInfo": "أدعية السجود",
		"enAzkar": "Abu Huraira reported: The Messenger of Allah (ﷺ) said: The nearest a servant comes to his Lord is when he is prostrating himself, so make supplication (in this state).",
		"enInfo": "Supplication whilst prostrating (sujuud)",
		"groupId": 5,
		"id": 88,
		"repeat": 1
	}, {
		"arAzkar": "",
		"arInfo": "أدعية الجلوس بين السجدتين",
		"enAzkar": "",
		"enInfo": "Supplication between the two prostrations",
		"groupId": 5,
		"id": 89,
		"repeat": 1
	}, {
		"arAzkar": "رَبِّ رَبِّ اغْفِرْ لِيْ، رَبِّ اغْفِرْ لِيْ.",
		"arInfo": "أدعية الجلوس بين السجدتين",
		"enAzkar": "My Lord forgive me, My Lord forgive me.",
		"enInfo": "Supplication between the two prostrations",
		"groupId": 5,
		"id": 90,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ اغْفِرْ لِيْ، وَارْحَمْنِيْ، وَاهْدِنِيْ، وَاجْرْنِيْ، وَعَافِنِيْ، وَارْزُقْنِيْ، وَارْفَعْنِيْ.",
		"arInfo": "أدعية الجلوس بين السجدتين",
		"enAzkar": "O Allaah, forgive me, have mercy upon me, guide me, enrich me, give me health, grant me sustenance and raise my rank.",
		"enInfo": "Supplication between the two prostrations",
		"groupId": 5,
		"id": 91,
		"repeat": 1
	}, {
		"arAzkar": "كان النبي صلى الله عليه وسلم يطيل هذا الركن بقدر السجود",
		"arInfo": "أدعية الجلوس بين السجدتين",
		"enAzkar": "",
		"enInfo": "Supplication between the two prostrations",
		"groupId": 5,
		"id": 92,
		"repeat": 1
	}, {
		"arAzkar": "سَجَدَ وَجْهِيَ للَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ، فَتَبَارَكَ اللَّهُ أَحْسَنُ الْـخَالِقِينَ.",
		"arInfo": "دعاء سجود التلاوة",
		"enAzkar": "My face fell prostrate before He who created it and brought forth its faculties of hearing and seeing by His might and power. so Blessed is Allaah, the best of creators.",
		"enInfo": "Supplication when prostrating due to recitation of the Qur’aan",
		"groupId": 5,
		"id": 93,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أجْراً، وَضَعْ عَنِّي بِهَا وِزْرَاً، واْجعَلْهَا لِي عِنْدِكَ ذُخْراً، وتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ.",
		"arInfo": "دعاء سجود التلاوة",
		"enAzkar": "O Allaah, record for me a reward for this (prostration), and remove from me a sin. Save it for me and accept it from me just as You had accepted it from Your servant Daawud.",
		"enInfo": "Supplication when prostrating due to recitation of the Qur’aan",
		"groupId": 5,
		"id": 94,
		"repeat": 1
	}, {
		"arAzkar": "التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ. وردت صيغ أخرى للتشهد قريبة من هذا.",
		"arInfo": "التشهد الأول",
		"enAzkar": "Attahiyyatu lillahi wassalawatu wattayyibat, assalamu AAalayka ayyuhan-nabiyyu warahmatul-lahi wabarakatuh, assalamu AAalayna waAAala AAibadil-lahis-saliheen. Ash-hadu an la ilaha illal-lah, wa-ashhadu anna Muhammadan AAabduhu warasooluh.\n‘At-tahiyyat is for Allah. All acts of worship and good deeds are for Him.  Peace and the mercy and blessings of Allah be upon you O Prophet.  Peace be upon us and all of Allah’s righteous servants. I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger.’\nAt-tahiyyat: all words which indicate the glorification of Allah.  His eternal existence, His perfection and His sovereignty.",
		"enInfo": "The First Tashahhud",
		"groupId": 5,
		"id": 95,
		"repeat": 1
	}, {
		"arAzkar": "التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ. اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.",
		"arInfo": "التشهد الأخير",
		"enAzkar": "Attahiyyatu lillahi wassalawatu wattayyibat, assalamu AAalayka ayyuhan-nabiyyu warahmatul-lahi wabarakatuh, assalamu AAalayna waAAala AAibadil-lahis-saliheen. Ash-hadu an la ilaha illal-lah, wa-ashhadu anna Muhammadan AAabduhu warasooluh.\n‘At-tahiyyat is for Allah. All acts of worship and good deeds are for Him.  Peace and the mercy and blessings of Allah be upon you O Prophet.  Peace be upon us and all of Allah’s righteous servants. I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger.’\nAt-tahiyyat: all words which indicate the glorification of Allah.  His eternal existence, His perfection and His sovereignty, Allahumma salli AAala Muhammad, wa-AAala ali Muhammad, kama sallayta AAala Ibraheema wa-AAala ali Ibraheem, innaka Hameedun Majeed, allahumma barik AAala  Muhammad, wa-AAala ali Muhammad, kama barakta AAala Ibraheema wa-AAala ali Ibraheem, innaka Hameedun Majeed.\n‘O Allah, send prayers upon Muhammad and the followers of Muhammad, just as You sent prayers upon Ibraheem and upon the followers of Ibraheem.  Verily, You are full of praise and majesty. O Allah, send blessings upon Mohammad and upon the family of Muhammad, just as You sent blessings upon Ibraheem and upon the family of Ibraheem.  Verily, You are full of praise and majesty.’\nsend prayers: praise and exalt him in the highest and superior of gatherings: that of the closest angels to Allah.\n(al) has been translated in it’s broadest sense: some scholars are of the view that the meaning here is more specific and that it means: his  followers from among his family.\n",
		"enInfo": "The Second Tashahhud",
		"groupId": 5,
		"id": 96,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ إِنِّيْ أعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ.",
		"arInfo": "أدعية بعد التشهد الأخير وقبل السلام",
		"enAzkar": "Allahumma innee aAAoothu bika min AAathabil-qabr, wamin AAathabi jahannam, wamin fitnatil-mahya walmamat, wamin shari fitnatil-maseehid-dajjal.\n‘O Allah, I take refuge in You from the punishment of the grave, from the torment of the Fire, from the trials and tribulations of life and death and from the evil affliction of Al-Maseeh Ad-Dajjal.’\nAl-Maseeh Ad-Dajjal: among the great signs of the last hour and the greatest trials to befall mankind, which every Prophet has warned about.  Most of mankind will follow him. He will appear from Asbahan, Iran at the time when the Muslims will conquer Constantinople.  He will be given special powers and will make the truth seem false and vice versa.  He will claim to be righteous and then he will claim prophethood and finally, divinity.  From his features is that he will be blind in his right eye which is a definite proof that contradicts his claim to be Allah as it is a sign of imperfection.  The word Kafir will be written between his eyes which every believer, literate or illiterate will recognise.\n",
		"enInfo": "Supplication said after the last tashahhud and before salam",
		"groupId": 5,
		"id": 97,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ. وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ. وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَم ِ",
		"arInfo": "أدعية بعد التشهد الأخير وقبل السلام",
		"enAzkar": "Allahumma innee aAAoothu bika min AAathabil-qabr, wa-aAAoothu bika min fitnatil-maseehid-dajjal, wa-aAAoothu bika min fitnatil-mahya walmamat. Allahumma innee aAAoothu bika minal-ma/thami walmaghram.\n‘O Allah, I take refuge in You from the punishment of the grave, and I take refuge in You from the temptation and trial of Al-Maseeh Ad-Dajjal, and I take refuge in You from the trials and tribulations of life and death.  O Allah, I take refuge in You from sin and debt.’\n",
		"enInfo": "",
		"groupId": 5,
		"id": 98,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً ، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ.",
		"arInfo": "أدعية بعد التشهد الأخير وقبل السلام",
		"enAzkar": "Allahumma innee thalamtu nafsee thulman katheeran wala yaghfiruth-thunooba illa ant, faghfir lee maghfiratan min AAindik warhamnee, innaka antal-Ghafoorur-Raheem.\n‘O Allah, I have indeed oppressed my soul excessively and none can forgive sin except You, so forgive me a forgiveness from Yourself and have mercy upon me.  Surely, You are The Most-Forgiving, The Most-Merciful.’\nFrom Yourself: i.e. from Your innermost grace without deserving it and a forgiveness which is befitting to your tremendous generosity.\n",
		"enInfo": "Supplication said after the last tashahhud and before salam",
		"groupId": 5,
		"id": 99,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ. وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ. وَمَا أَسْرَفْتُ. وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ. لاَ إِلهَ إِلاَّ أَنْتَ.",
		"arInfo": "أدعية بعد التشهد الأخير وقبل السلام",
		"enAzkar": "Allahummagh-fir lee ma qaddamtu,  wama akhkhart, wama asrartu wama aAAlant, wama asraftt, wama anta aAAlamu bihi minnee, antal-muqaddimu wa-antal-mu-akhkhiru la ilaha illa ant.\n‘O Allah, forgive me for those sins which have come to pass as well as those which shall come to pass, and those I have committed in secret as well as those I have made public, and where I have exceeded all bounds as well as those things about which You are more knowledgeable. You are Al-Muqaddim and Al-Mu-akhkhir.  None has the right to be worshipped except You.’\nMeaning of Al-Muqaddim and Al-Mu-akhkhir: Allah puts forward and favours whom He wills from amongst His creation just as He defers and holds back whom He wills in accordance to His wisdom.  E.g.  Favouring man over the rest of creation, favouring the Prophets over the rest of mankind, favouring Muhammad  over all the Prophets and Messengers…etc.\n",
		"enInfo": "Supplication said after the last tashahhud and before salam",
		"groupId": 5,
		"id": 100,
		"repeat": 1
	}, {
		"arAzkar": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ.",
		"arInfo": "أدعية بعد التشهد الأخير وقبل السلام",
		"enAzkar": "",
		"enInfo": "Supplication said after the last tashahhud and before salam",
		"groupId": 5,
		"id": 101,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ إِنِّيْ أسْألُكَ الْجَنَّةَ وَأعُوْذُ بِكَ مِنَ النَّارِ.",
		"arInfo": "أدعية بعد التشهد الأخير وقبل السلام",
		"enAzkar": "Allahumma innee as-alukal-jannah, wa-aAAoothu bika minan-nar.\n‘O Allah, I ask You to grant me Paradise and I take refuge in You from the Fire.’",
		"enInfo": "Supplication said after the last tashahhud and before salam",
		"groupId": 5,
		"id": 102,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ إِنِّيْ أسْألُكَ يَا أللهُ بِأنَّكَ الْوَاحِدُ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ، وَلَمْ يَكنْ لَهُ كُفُوًا أحَدٌ، أنْ تَغْفِرَ لِيْ ذُنُوْبِيْ إِنَّكَ أنْتَ الْغَفُوْرُ الرَّحِيْمُ.",
		"arInfo": "أدعية بعد التشهد الأخير وقبل السلام",
		"enAzkar": "Allahumma innee as-aluka ya Allah bi-annakal-wahidul-ahadus-samad, allathee lam yalid walam yoolad, walam yakun lahu kufuwan ahad, an taghfira lee thunoobee innaka antal-Ghafoorur-Raheem.\n‘O Allah, I ask You O Allah, as You are The One, The Only, AS-Samad, The One who begets not, nor was He begotten and there is none like unto Him that You forgive me my sins for verily You are The Oft-Forgiving, Most-Merciful.’\nAS-Samad: The Self-Sufficient Master, Possessor of perfect attributes whom all of creation turn to in all their needs.",
		"enInfo": "Supplication said after the last tashahhud and before salam",
		"groupId": 5,
		"id": 103,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ حَاسِبْنِيْ حِسَابَاً يَسِيراً.",
		"arInfo": "أدعية بعد التشهد الأخير وقبل السلام",
		"enAzkar": "Allahumma hasibni hisaban yasira(O Allah! Call me to account with an easy accounting)",
		"enInfo": "Supplication said after the last tashahhud and before salam",
		"groupId": 5,
		"id": 104,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ إِنِّيْ أسْألُكَ بِأنَّيْ أشْهَدُ أنَّكَ أنْتَ اللهُ لَا إِلَهَ إِلَّا أنْتَ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أحَدٌ.",
		"arInfo": "أدعية بعد التشهد الأخير وقبل السلام",
		"enAzkar": "Allahumma inne as-aluka biannee ashhadu annaka antal-lah, la ilaha illa ant, al-ahadus-samad, allathee lam yalid walam yoolad walam yakun lahu kufuwan ahad.\n(‘O Allah, I ask You, as I bear witness that You are Allah, none has the right to be worshipped except You, The One, AS-Samad Who begets not nor was He begotten and there is none like unto Him.’)\nAS-Samad: The Self-Sufficient Master, Possessor of perfect attributes whom all of creation turn to in all their needs.",
		"enInfo": "Supplication said after the last tashahhud and before salam",
		"groupId": 5,
		"id": 105,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ بِعِلْمِكَ الغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أحْيِنِيْ مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِيْ، وَتَوَفَّنِيْ إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِيْ، اللهم إِنِّيْ أسْألُكَ خَشْيَتَكَ فِيْ الْغَيْبِ وَالشَّهَادَةِ، وَأسْألُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأسْألُكَ الْقَصْدَ فِيْ الْغِنَى وَالْفَقْرِ، وَأسْألُكَ نَعِيْمًا لَا يَنْفَدُ، وَأسْألُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأسْألُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأسْألُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأسْألُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقائِكَ فِيْ غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللهم زَيِّنَّا بِزِينَةِ الْإِيْمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِيْنَ.",
		"arInfo": "أدعية بعد التشهد الأخير وقبل السلام",
		"enAzkar": "Allahumma biAAilmikal-ghayb, waqudratika AAalal-khalq, ahyinee ma AAalimtal-hayata khayran lee watawaffanee itha AAalimtal-wafata khayran lee, allahumma innee as-aluka khashyataka fil-ghaybi washshahadah, wa-as-aluka kalimatal-haqqi fir-rida walghadab, wa-as-alukal-qasda fil-ghina walfaqr, wa-as-aluka naAAeeman la yanfad, wa-as-aluka qurrata AAaynin la tanqatiAA, wa-as-alukar-rida baAAdal-qada/, wa-as-aluka bardal-AAayshi baAAdal-mawt, wa-as-aluka laththatan-nathari ila wajhik, washshawqa ila liqa-ik fee ghayri darraa mudirrah, wala fitnatin mudillah, allahumma zayyinna bizeenatil-eeman wajAAalna hudatan muhtadeen.\n‘O Allah, by Your knowledge of the unseen and Your power over creation, keep me alive so long as You know such life to be good for me and take me if You know death to be better for me.  O Allah, make me fearful of You whether in secret or in public and I ask You to make me true in speech, in times of pleasure and anger.I ask you to make me moderate in times of wealth and poverty and I ask You for everlasting bliss and joy which will never cease.I ask You to make me pleased with what You have decreed and for an easy life after death.I ask You for the sweetness of looking upon Your Face and a longing to encounter You in a manner which does not entail a calamity which will bring about harm nor a trial which will cause deviation. O Allah, beautify us with the adornment of faith and make us of those who guide and are rightly guided.’\n",
		"enInfo": "Supplication said after the last tashahhud and before salam",
		"groupId": 5,
		"id": 106,
		"repeat": 1
	}, {
		"arAzkar": "أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.",
		"arInfo": "",
		"enAzkar": "Astaghfirul-lah,‘I ask Allah for forgiveness.",
		"enInfo": "",
		"groupId": 6,
		"id": 107,
		"repeat": 1
	}, {
		"arAzkar": "اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام .",
		"arInfo": "",
		"enAzkar": "Allahumma antas-salam waminkas-salam, tabarakta ya thal-jalali wal-ikram.\n‘O Allah, You are As-Salam and from You is all peace, blessed are You, O Possessor of majesty and honour.’\nAS-Salam: The One Who is free from all defects and deficiencies.",
		"enInfo": "",
		"groupId": 6,
		"id": 108,
		"repeat": 1
	}, {
		"arAzkar": "لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد.",
		"arInfo": "",
		"enAzkar": "La ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer, allahumma la maniAAa lima aAAtayt, wala muAAtiya lima manaAAt, wala yanfaAAu thal-jaddi minkal-jad.\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent.O Allah, none can prevent what You have willed to bestow and none can bestow what You have willed to prevent, and no wealth or majesty can benefit anyone, as from You is all wealth and majesty.’\n",
		"enInfo": "",
		"groupId": 6,
		"id": 109,
		"repeat": 1
	}, {
		"arAzkar": "لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون.",
		"arInfo": "",
		"enAzkar": "La ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer. la hawla wala quwwata illa billah, la ilaha illal-lah, wala naAAbudu illa iyyah, lahun-niAAmatu walahul-fadl walahuth-thana-ol- hasan, la ilaha illal-lah mukhliseena lahud-deen walaw karihal-kafiroon.\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent.  There is no might nor power except with Allah, none has the right to be worshipped except Allah and we worship none except Him.  For Him is all favour, grace, and glorious praise.  None has the right to be worshipped except Allah and we are sincere in faith and devotion to Him although the disbelievers detest it.’\n",
		"enInfo": "",
		"groupId": 6,
		"id": 110,
		"repeat": 1
	}, {
		"arAzkar": "سُـبْحانَ اللهِ",
		"arInfo": "",
		"enAzkar": "Subhanal-lah,How perfect Allah is",
		"enInfo": "",
		"groupId": 6,
		"id": 111,
		"repeat": 33
	}, {
		"arAzkar": " الحَمْـدُ لله",
		"arInfo": "",
		"enAzkar": "Alhamdu lillah,all praise is for Allah",
		"enInfo": "",
		"groupId": 6,
		"id": 112,
		"repeat": 33
	}, {
		"arAzkar": "اللهُ أكْـبَر.",
		"arInfo": "",
		"enAzkar": "Allahu akbar,Allah is the greatest.",
		"enInfo": "",
		"groupId": 6,
		"id": 113,
		"repeat": 33
	}, {
		"arAzkar": "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير.",
		"arInfo": "",
		"enAzkar": "La ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer.\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent.’\n",
		"enInfo": "",
		"groupId": 6,
		"id": 114,
		"repeat": 1
	}, {
		"arAzkar": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
		"arInfo": "",
		"enAzkar": "{Qul huwa Allahu ahad…}\tAl-Ikhlas",
		"enInfo": "",
		"groupId": 6,
		"id": 115,
		"repeat": 1
	}, {
		"arAzkar": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
		"arInfo": "",
		"enAzkar": "{Qul aAAoothu birabbi alfalaq…..}\tAl-Falaq",
		"enInfo": "",
		"groupId": 6,
		"id": 116,
		"repeat": 1
	}, {
		"arAzkar": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
		"arInfo": "",
		"enAzkar": "{Qul aAAoothu birabbi alnnas…..}\tAn-Nas",
		"enInfo": "",
		"groupId": 6,
		"id": 117,
		"repeat": 1
	}, {
		"arAzkar": "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. آية الكرسى - البقرة 255",
		"arInfo": "",
		"enAzkar": "{Allahu la ilaha illa huwa alhayyu alqayyoomu la ta/khuthuhu sinatun wala nawm…}\n    Al-Baqarah:255",
		"enInfo": "",
		"groupId": 6,
		"id": 118,
		"repeat": 1
	}, {
		"arAzkar": "لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير.",
		"arInfo": "",
		"enAzkar": "La ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, yuhyee wayumeet, wahuwa AAala kulli shayin qadeer.\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, He gives life and causes death and He is over all things omnipotent.’\n",
		"enInfo": "",
		"groupId": 6,
		"id": 119,
		"repeat": 1
	}, {
		"arAzkar": "اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً.",
		"arInfo": "",
		"enAzkar": "Allahumma innee as-aluka AAilman nafiAAan, warizqan tayyiban, waAAamalan mutaqabbalan ,(‘O Allah, I ask You for knowledge which is beneficial and sustenance which is good, and deeds which are acceptable)",
		"enInfo": "",
		"groupId": 6,
		"id": 120,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ أَجِرْنِي مِنْ النَّار.",
		"arInfo": "",
		"enAzkar": "Allahuma Ajirni minan naar (O Allah, save me from the fire \"Jahannam\")",
		"enInfo": "(To be said after giving salam for the fajr prayer)",
		"groupId": 6,
		"id": 121,
		"repeat": 1
	}, {
		"arAzkar": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ.",
		"arInfo": "",
		"enAzkar": "Allah-humma A‘in-nee ‘Ala Thikri-ka wa Shukri-ka wa Husni ‘Ebaadati-ka\n(O Allah help me to remember you, and thank you, and worship you in the best possible way!)",
		"enInfo": "after the maghrib and fajr prayers",
		"groupId": 6,
		"id": 122,
		"repeat": 1
	}, {
		"arAzkar": "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور.",
		"arInfo": "",
		"enAzkar": "",
		"enInfo": "",
		"groupId": 7,
		"id": 123,
		"repeat": 1
	}, {
		"arAzkar": "الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه.",
		"arInfo": "",
		"enAzkar": "Alhamdu lillahil-lathee AAafanee fee jasadee waradda AAalayya roohee wa-athina lee bithikrih.\n‘All praise is for Allah who restored to me my health and returned my soul and  has allowed me to remember Him.’",
		"enInfo": "",
		"groupId": 7,
		"id": 124,
		"repeat": 1
	}, {
		"arAzkar": "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد، وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ، ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي.\n",
		"arInfo": "",
		"enAzkar": "La ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shay-in qadeer, subhanal-lah, walhamdu lillah, wala  ilaha illal-lah wallahu akbar, wala hawla wala quwwata illa billahil-AAaliyyil AAatheem.\n‘None has the right to be worshipped except Allah, alone without associate, to Him belongs sovereignty and praise and He is over all things wholly capable.  How perfect Allah is, and all praise is for Allah, and none has the right to be worshipped except Allah, Allah is the greatest and there is no power nor might except with Allah, The Most High, The Supreme.Rabbigh-fir lee\n‘O my Lord forgive me.’",
		"enInfo": "",
		"groupId": 7,
		"id": 125,
		"repeat": 1
	}, {
		"arAzkar": "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين.",
		"arInfo": "",
		"enAzkar": "Bismika rabbee wadaAAtu janbee wabika arfaAAuh, fa-in amsakta nafsee farhamha, wa-in arsaltaha fahfathha bima tahfathu bihi AAibadakas-saliheen.\n‘In Your name my Lord, I lie down and in Your name I rise, so if You should take my soul then have mercy upon it, and if You should return my soul then protect it in the manner You do so with Your righteous servants.’",
		"enInfo": "",
		"groupId": 8,
		"id": 126,
		"repeat": 1
	}, {
		"arAzkar": "اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة.",
		"arInfo": "",
		"enAzkar": "Allahumma innaka khalaqta nafsee wa-anta tawaffaha, laka mamatuha wamahyaha in ahyaytaha fahfathha, wa-in amattaha faghfir laha. Allahumma innee as-alukal-AAafiyah.\n‘O Allah, verily You have created my soul and You shall take it’s life, to You belongs it’s life and death. If You should keep my soul alive then protect it, and if You should take it’s life then forgive it. O Allah, I ask You to grant me good health.’",
		"enInfo": "",
		"groupId": 8,
		"id": 127,
		"repeat": 1
	}, {
		"arAzkar": "اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك.",
		"arInfo": "",
		"enAzkar": "Allahumma qinee AAathabaka yawma tabAAathu AAibadak.\n‘O Allah, protect me from Your punishment on the day Your servants are resurrected.",
		"enInfo": "",
		"groupId": 8,
		"id": 128,
		"repeat": 1
	}]
}